{"modelTopology": {"training_config": {"sample_weight_mode": null, "metrics": ["accuracy"], "optimizer_config": {"config": {"beta_2": 0.9990000128746033, "epsilon": 1e-07, "decay": 0.0, "amsgrad": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "loss": "categorical_crossentropy", "loss_weights": null, "weighted_metrics": null}, "keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "activity_regularizer": null, "kernel_size": [5, 5], "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 128, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling2d_1", "trainable": true, "pool_size": [3, 3], "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "activity_regularizer": null, "kernel_size": [2, 2], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 64, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "activity_regularizer": null, "kernel_size": [2, 2], "bias_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 32, "bias_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "same", "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "dtype": "float32", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_constraint": null, "units": 512, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "dtype": "float32", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_constraint": null, "units": 24, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}}, "format": "layers-model", "convertedBy": "TensorFlow.js Converter v2.3.0", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [5, 5, 1, 128], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [2, 2, 128, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [2, 2, 64, 32], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [512, 24], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [24], "dtype": "float32"}]}], "generatedBy": "keras v2.3.1"}